notes/Theory/HillmanTypology_Notes.tex
% Created 2017-05-21 Sun 21:57
% Intended LaTeX compiler: pdflatex
\documentclass[10pt, letterpaper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{bussproofs}
\author{Jeffrey Young}
\date{May 21, 2017}
\title{Primer on Dan Hillman's Thesis}
\hypersetup{
 pdfauthor={Jeffrey Young},
 pdftitle={Primer on Dan Hillman's Thesis},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.1 (Org mode 9.0.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{Executive Summary}
\label{sec:orgc05307c}
\subsection*{Is Hillman's data suitable for our us:}
\label{sec:org802bb86}
Yes. I believe we will be able to make
use of his data, but we will not be able to say anything in regards to
Substantive Meaning using this data.

\subsection*{Is Hillman's typology more expressive or less expressive than Bellack's, should we us Hillman's or Bellack's:}
\label{sec:org6f1692c}
We should use Hillman's Typology, in many
ways it is a large improvement over Bellack's and his agreement rate is > 90\%.
We will need to modify his typology as he collapses the Substantive meaning
category so that it \emph{does not} need to be described \emph{for every} topic. 

\subsection*{What did Hillman learn from his data:}
\label{sec:org1516f70}
TBD, I ran out of time and didn't get to this.

\subsection*{Other considerations}
\label{sec:org9c7dff5}
You may want to look over the "Reference that will be useful" section as this
paper is well sources, and is a good branching point for other papers to
check out. I've highlighted some interesting ones.
\section*{Source Document}
\label{sec:org09f9064}
The source document, for this primer is located here:
\url{http://www.quahog.org/thesis/new.html}
\section*{Context}
\label{sec:orgce5ea3c}
This document is for the XOP Encoding project, participants include Eric
Walkingshaw and Jeffrey Young. This is the third such primer in the project,
the first one is a primer on DN-Theory, the second a primer on typologies of
explanation, specifically Bellack et al's typology. This document expands on
bellack et al's typology by summarizing the thesis of Dan Hillman. Dan Hillman
iterated on bellack's typology, changing and improving it in several ways, and
hence his typology is of interest to the XOP project. Dan Hillman was also kind
enough to provide the data he compiled with his typology for the XOP Project.
\section*{Orientation}
\label{sec:orgc325696}
This document is meant to explicate three things:
\begin{enumerate}
\item What are Hillman's changes to Bellack's typology and why
\item What is the nature of the data that Hillman compiled and it is useful to the
XOP project?
\item What did Hillman learn from his data, what were the conclusions of his
thesis?
\end{enumerate}

The document assumes you are familiar with Bellack et al's typology, and the
XOP Projects goals, progress, and current issues. If any of those is not the
case then please refer to prior documents to orientate yourself before reading
on.
\section*{Details on Hillman's Data}
\label{sec:org304ff17}

\subsection*{General Details of the Data}
\label{sec:orge3d96a8}
\begin{itemize}
\item n = \textasciitilde{}51,000
\item Data is composed of Face-To-Face (FTF) and Computer-Mediated-Communication
(CMC)
\item All data is from courses taught at New York School of Education between
1994 - 1995
\item Data was recorded from 2 classes:
\begin{enumerate}
\item Systems Analysis and Design
\item Database Management and Systems
\end{enumerate}
\item Both courses had FTF and CMC versions, and both versions taught the same
material
\end{itemize}
\subsection*{Details on the Transcription of the Data}
\label{sec:org89b7396}
\begin{itemize}
\item FTF courses were recorded on audio cassette, transcribed to word docs, then
munged into a database
\item Participants for CMC courses communicated, and were recorded, by Lotus Notes.
\item only interactions that encompassed \emph{the whole class} was included
\item interactions during breaks were not considered or included
\item Any small group discussions that took place were not considered or included
\item No one working on the transcript, editing, or the coding, had knowledge of
what was transcribed, which participant said it, or the purpose of the
research
\end{itemize}

\subsection*{Database and data information details}
\label{sec:org1d27a59}
\subsubsection*{Database Contains}
\label{sec:org13b995b}
\begin{itemize}
\item All text
\item Participants sex
\item Participants role (Teacher/Student)
\item Number of words in each sentence
\item Metadata of course (Course name, date etc.)
\end{itemize}
\subsubsection*{Data alterations}
\label{sec:orgb87bfab}
\begin{itemize}
\item All audio recordings were pre-pended with a character to denote the speaker, one of:
\begin{enumerate}
\item t \(\triangleq\) teacher
\item m \(\triangleq\) male student
\item f \(\triangleq\) female student
\end{enumerate}
\end{itemize}
\subsection*{Hillman's Problems with Bellack et al's typology}
\label{sec:org02ba95f}
Most of this is taken directly from Hillman's thesis:
\begin{enumerate}
\item Problem: Bellack's system fails to differentiate between a one-word
response and a one-liner response. This is consequent of Bellack et al's
decision to round any non-line utterance to length 1.

Effect: This gives unfair weight to utterances that are less than one-line
length, which distorts the differences between teacher and student
utterances (with the latter being inflated).
\item Problem: Structuring and Soliciting moves fail to capture monologues or exegesis

Effect: This constrains the systems unit of analysis, in fact, Hillman
found that studies which employed Bellack's system, and Bellack et al's
own data, have almost no monologues by the teacher, and are almost never
have adult student participants - only children.
\item Problem: The difference between Responding and Reacting moves is often
minimal and the two are easily interchangable, especially in asynchronous
communication (Bellack et al assumed synchronous communication e.g. a
conversation)

Effect: Superfluous encodings and noise in agreement rate
\item Problem: Substantive meanings fail to account for progressive levels of
meaning, which, in turn, make it difficult to code for any subject in
which the same idea or procedures are used at higher levels. For example,
in a math class one would learn multiplication or division not as an end
in and of itself, but as part of a larger process. Bellack's system cannot
account for this in a clean way.
\item Problem: Substantive Meanings are not abstracted from the course material
at all. In general, each substantive meaning is derived from the course
material, but if that material differs slightly than the meanings must
also change.

Effect: Comparing courses on the same material or topic becomes more
difficult
\item Problem: Instructional Meanings are similarly limited
\item Problem: Inclusion of an Audio-Video devices inflates its importance in
the classroom interaction to that of the participant. 

Effect: One cannot claim that if a teacher plays a move or audio snippet
as part of the lesson that the student is interacting with the content in
\emph{an observable} manner.
\item Problem: Bellack et al's system does not distinguish between differences
in students.

Effect: One cannot analyze the variable of sex in the data.
\item Problem: Bellack et al's system distinguishes between discussion that
occurs "as the result of an assignment", and intra-classroom discourse.

Effect: This excludes discourse which occurs from a teacher assigning work
\emph{and then} building on that assignment in class.
\end{enumerate}

\section*{Hillman's modifications to Bellack's Typology}
\label{sec:org7f63dee}
Hillman's Typology consists of three Tiers with the first being Purpose:
