notes/Theory/HillmanTypology_Notes.tex
\subsection*{Subject}
\label{sec:orgb8a84ee}
This tier describes \emph{what} is being discussed in the sentence, the content
being considered or statements \emph{about} something.

\begin{enumerate}
\item Person: The subject of a sentence is literally a person.

Ex. "I was pleased to have the opportunity to get to know you a bit
through my role as Client in the Systems Analysis course Case Study."
[Lecturing/Opining/Person]

\item Action: a person or object does something, this definition includes
Bellack et al.'s definition of Action.

Ex. "Those of you who do not have books, look on."
[Eliciting/Performing/Action]

\item Procedure: A subset of Action, in which one is told \emph{how} to do something,
rather than just \emph{to do} something.

Ex. "If you've already made a new replica of the User's Guide, please do
not replicate it further until the above mentioned posting."
[Eliciting/Performing/Procedure]

\item Content: This code is used for sentences related to course content. This
is Bellack's Substantive Meaning category, except that instead of defining
it in terms of the specific content of the subject, it is defined as being
\emph{on-topic}. If a sentence refers to the \emph{subject} of the course, then it
is \emph{on-topic}, and is Content.

Ex. "With relational, you basically retrieve multiple records at a single
time and the system decides how to access based on your call."
[Lecturing/Explaining/Content]

\item Supplies: The subject of the sentence deals with course material, teaching
aids, and devices, be they books, forms, projectors, computers etc..

Ex. "This tape is about three years old." [Lecturing/Fact-Stating/Supplies]

\item Not Clear: The bottom value for the Supply tier.
\end{enumerate}
\subsection*{Handling Combined moves}
\label{sec:org37cc4f5}
If a sentence encompasses more than one subject, it is coded as the highest
appropriate level. Thus, to use Bellack et al.'s example, a teacher directing
students to engage in some classroom procedure which required the use of
supplies would be coded as Procedure-Supplies. The rationale is that to have
the course, one must have students (Person). These students may be directed
(Action) to engage in some classroom Procedure (Procedure) which required the
use of Supplies (Supplies).

\section*{References that will be of use and why}
\label{sec:orgb3f7f70}
\begin{enumerate}
\item Paper: Weber, R. P. (1985). Basic content analysis. Beverly Hills: Sage
Publications.

Why: This paper defines and describes general steps to classify a text into
categories of content.

\item Paper: Atkinson, P. (1981). Inspecting classroom talk. In C. Adelman (Ed.),
Uttering, muttering: Collecting, using and reporting talk for social and
educational research, (pp. 98-113). London: Grant McIntyre Ltd. 

Why: This paper explains that, the ability to respond, and participate in
interactions, in synchronous communication, is made possible by the \emph{typing}
of utterances that immediately precede that one.

\item Paper: Sacks, H., Schegloff, E., \& Jefferson, G. (1974). A simplest
systematics for the organisation of turn-taking for conversation. Language,
50, 696-735.

Why: This paper expands on Atkinson's paper by describing interactions as
an adjacency pair.
\end{enumerate}


\section*{Other thoughts}
\label{sec:orgcd6c308}
\begin{itemize}
\item Bellack's system is synchronous i.e. based on discourse and inter-locution.
Computer based learning artifacts are asynchronous i.e. one sided exegeses.
The DSL we are trying to make is\ldots{}synchronous? or asynchronous, I'm
pretty sure we discussed this as synchronous.
\end{itemize}
\end{document}